app/controllers/items_controller.rb

  def index
    respond_to do |format|
      format.json { render json: Item.all }
---
SELECT "items".* FROM "items"

  def create
    @item = Item.new(item_params)
      if @item.save
---
INSERT INTO "items" ("title", "notes", "created_at", "updated_at", "done") VALUES (?, ?, ?, ?, ?)  [["title", "Estudar para prova de física"], ["notes", "Cap 25"], ["created_at", "2018-03-23 01:14:24.052249"], ["updated_at", "2018-03-23 01:14:24.052249"], ["done", "f"]]

  def update
    @item= Item.find(params[:id])
    if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "items" SET "notes" = ?, "done" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["notes", "Cap 25"], ["done", "t"], ["updated_at", "2018-03-26 05:59:04.302961"], ["id", 3]]

  def show
    respond_with(Item.find(params[:id]))
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy
    respond_with Item.destroy(params[:id])
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]